Repository: cogwheel0/conduit
Catalog: lib/l10n/app_*.arb
Languages: kab

source: Retry
kab: Ɛreḍ tikkelt niḍen

source: Back
kab: Tuɣalin

# closeButtonSemantic
source: Close
kab: Mdel

source: Loading content
kab: Asali n ugbur

source: Send
kab: Azen

source: Web Search
kab: Anadi deg Web

source: Unarchive
kab: Kkes seg uḥraz

source: Archive
kab: Seɣber

source: Pin
kab: Senteḍ

source: Unpin
kab: Serreḥ

source: Recent
kab: Melmi kan

source: System
kab: Anagraw

source: English
kab: Taglizit

# deleteMessagesTitle
source: Delete Messages
kab: Kkes iznan

# deleteChatTitle
source: Delete Chat
kab: Kkes adiwenni

source: Pinned
kab: Yettwasenteḍ

source: Folders
kab: Ikaramen

source: Archived
kab: Yettwaḥrez

source: App language
kab: Tutlayt n usnas

source: Dark mode
kab: Askar ubrik

source: Image Generation
kab: Asirew n tugniwin

source: Account
kab: Amiḍan

source: Sign Out
kab: Senser

source: Default Model
kab: Tamudemt tamezwart

source: Loading models...
kab: Aɛebbi n tmudmiwin…

source: No results
kab: Ulac igmaḍ

source: Search models...
kab: Nadi timudmiwin…

# errorMessage
source: Something went wrong. Please try again.
kab: Yella wacu ur neddi ara. Ɛreḍ tikkelt niḍen.

# loginButton
source: Login
kab: Tuqqna

# menuItem
source: Settings
kab: Iɣewwaren

source: No items
kab: Ulac iferdisen

source: Load More
kab: Sali-d ugar

source: Workspace
kab: Tamnaḍṭ n umahil

source: Recent Files
kab: Ifuyla ineggura

source: Knowledge Base
kab: Taffa n tmusniwin

# takePhoto
source: Take a photo
kab: Ṭṭef tawlaft

source: Document
kab: Imesli

# uploadFileTitle
source: Upload File
kab: Zdem afaylu

source: Sign In
kab: Qqen

source: Credentials
kab: Inekcam

source: API Key
kab: Tasarut API

source: Username or Email
kab: Isem n useqdac neɣ imayl

source: Password
kab: Awal n uɛeddi

source: Connect to Server
kab: Qqen ar uqeddac

source: Server URL
kab: URL n uqeddac

source: Connecting...
kab: Yetteqqen…

# connectToServerButton
source: Connect to Server
kab: Qqen ar uqeddac

source: Skip
kab: Anef-as

source: Next
kab: Uḍfiṛ

source: Done
kab: Immed

# onboardStartTitle
source: Start a conversation
kab: Bdu adiwenni

# onboardQuickTitle
source: Quick actions
kab: Tigawin tiruradin

source: Add attachment
kab: Seddu amedday

source: Tools
kab: Ifecka

source: Voice input
kab: Anekcum s taɣect

source: Send message
kab: Azen izen

source: File
kab: Afaylu

source: Photo
kab: Tawlaft

source: Camera
kab: Takamiṛat

source: Unable to load image
kab: D awezɣi asali n tugna

source: Confirm
kab: Sentem

source: Cancel
kab: Semmet

source: OK
kab: IH

source: Input field
kab: Urti n usekcem

source: Check Connection
kab: Senqed tuqqna

source: Open Settings
kab: Ldi iɣewwaren

source: Go Back
kab: Tuɣalin

source: Technical Details
kab: Talqayt tatiknikant

source: Save
kab: Sekles

source: Select Language
kab: Fren tutlayt

source: New Folder
kab: Akaram amaynut

source: Folder name
kab: Isem n ukaram

source: New Chat
kab: Adiwenni amaynut

source: More
kab: Ugar

source: Clear
kab: Sfeḍ

# searchHint
source: Search...
kab: Nadi…

source: Create
kab: Snulfu-d

source: Folder created
kab: Akaram yettwarna

source: Manage
kab: Sefrek

source: Rename
kab: Snifel isem

source: Delete
kab: Kkes

source: You
kab: Kečč·mm

source: Login failed
kab: Tuqqna ur teddi ara

# messageHintText
source: Message...
kab: Izen…

source: Stop generating
kab: Seḥbes asirew

# dynamicContentWithPlaceholder
source: Welcome, {name}!
kab: Ansuf a {name}!

source: Loading profile...
kab: Asali n umaɣnu…

source: Available Models
kab: Timudmiwin i yellan

# serverUrlHint
source: https://your-server.com
kab: https://aqeddac-nnwen.com

# chooseSourcePhoto
source: Choose your source
kab: Fren aɣbalu

source: Connected to Server
kab: Yeqqen ar uqeddac

# knowledgeBaseEmpty
source: Knowledge base is empty
kab: Taffa n tmussniwin, d tilemt

# chooseFromGallery
source: Choose from your photos
kab: Fren seg tewlafin-ik·im

source: Back to server setup
kab: Uɣal ar tawila n uqeddac

# documentHint
source: PDF, Word, or text file
kab: Afaylu PDF, Word neɣ aḍris

source: Sign in with API Key
kab: Tuqqna s tsarut API

# messageInputHint
source: Type your message
kab: Aru izen-ik·im

source: Use http:// or https:// only.
kab: Seqdec ala http:// neɣ https://.

source: Choose Model
kab: Fren tamudemt

source: Search conversations...
kab: Nadi idiwenniyen…

source: Choose Different File
kab: Fren afaylu niḍen

source: Deutsch
kab: Talmanit

# francais
source: Fran√ßais
kab: Tafṛansist

source: Italiano
kab: Taṭelyanit

source: About App
kab: Ɣef usnas

source: Enter chat name
kab: Aru isem n udiwenni

source: Rename Chat
kab: Senfel isem n udiwenni

source: Unable to load profile
kab: D awezɣi asali n umaɣnu

# pleaseCheckConnection
source: Please check your connection and try again
kab: Ttxil-k⋅m senqed tuqqna-k⋅m syen ɛreḍ tikkelt niḍen

source: End your session
kab: Fakk tiɣimit-ik⋅im

source: Auto-select
kab: Tafrant tawurmant

source: Failed to load models
kab: Yecceḍ usali n tmudmiwin

# itemsCount
source: {count, plural, =0{No items} one{1 item} other{{count} items}}
kab: {count, plural, =0{Ulac iferdisen} one{1 uferdis} other{{count} yiferdisen}}

source: No items to display
kab: Ulac aferdis ara d-yettwaskanen

source: No files yet
kab: Ulac ifuyla akka ar tura

# uploadDocsPrompt
source: Upload documents to reference in your conversations with Conduit
kab: Zdem isemliyen ara yettwasqedcen deg yisqerden-ik⋅im s Conduit

# uploadFirstFile
source: Upload your first file
kab: Zdem afaylu-ik⋅im amezwaru

source: Maximum headers reached
kab: Amḍan n yiqerra yewweḍ

source: Demo Mode Active
kab: Askar n uneɛruḍ, yermed

# headerValueHint
source: api-key-123 or Bearer token
kab: api-key-123 neɣ ajuṭu Bearer

# onboardAttachBullet2
source: Photos: camera or library
kab: Tiwlafin: takamiṛat neɣ tamkarḍit

# onboardAttachBullet1
source: Workspace: PDFs, docs, datasets
kab: Adeg n umahil: PDFs, isemliyen, tagrumma n yisefka

# serverUrlEmpty
source: Server URL cannot be empty
kab: URL n uqeddac ur ilaq ara ad yili d ilem

source: REVIEWER MODE
kab: ASKAR N USENQED

source: Invalid image format
kab: Amasal n tugna d arameɣtu

source: Empty image data
kab: Isefka n tugna, d ilmawen

# apiUnavailable
source: API service not available
kab: Aqeddac API ulac-it

# invalidDataUrl
source: Invalid data URL format
kab: Amasal n URL n yisefka d arameɣtu

source: Failed to decode image
kab: YEcceḍ usettengel n tugna

source: Failed to create folder
kab: Tecceḍ tmerna n ukaram

# movedChatToFolder
source: Moved "{title}" to "{folder}"
kab: "{title}" yettwasenkez ɣer "{folder}"

source: Failed to move chat
kab: Yecceḍ usenkez n udiwenni

source: Failed to load chats
kab: Yecceḍ usali n yidiwenniyen

source: Failed to update pin
kab: Yecceḍ uleqqem n usenteḍ

source: Failed to delete chat
kab: Tecceḍ tukksa n udiwenni

# notAnImageFile
source: Not an image file: {fileName}
kab: Mačči d afaylu n tugna: {fileName}

# failedToLoadImage
source: Failed to load image: {error}
kab: Yecceḍ usali n tugna: {error}

# captureDocumentOrImage
source: Capture a document or image
kab: Ṭṭef agdil i yisemli neɣ i tugna

source: Image Gen
kab: Asirew n tugna

# deleteMessagesMessage
source: Delete {count} messages?
kab: Kkes {count} n yiznan?

source: Failed to rename chat
kab: Yecceḍ usenfel n yisem n udiwenni

source: Failed to update archive
kab: Yecceḍ uleqqem aḥraz

# routeNotFound
source: Route not found: {routeName}
kab: Abrid ur yettwaf aa: {routeName}

# aboutAppSubtitle
source: Conduit information and links
kab: Talɣut d yiseɣwan Conduit

source: Type below to begin
kab: Aru ddaw-a akken ad tebduḍ

# imageGenerationDescription
source: Create images from your prompts.
kab: Snulfu-d tugniwin seg yineftaɣen-ik⋅im.

source: Initialization Failed
kab: Yecceḍ uwennez

# kbCreationComingSoon
source: Knowledge base creation is coming soon!
kab: Timerna n taffa n tmussniwin, ur yettɛeṭṭil ara ad d-yaweḍ!

# enterServerUrlSemantic
source: Enter your server URL or IP address
kab: Sekcem URL neɣ tansa IP n uqeddac-ik

source: Header Name
kab: Isem n uqerru

source: Header Value
kab: Azal n uqerru

source: Add header
kab: Rnu aqerru

source: Remove header
kab: Kkes aqerru

# enterCredentials
source: Enter your credentials to access your AI conversations
kab: Sekcem inekcam-ik⋅im akken ad tkecmeḍ ɣer yidiwenniyen-ik⋅im irigmawanen

# enterServerAddress
source: Enter your Open-WebUI server address to get started
kab: Sekcem tansa n uqeddac-ik⋅im Open-WebUI akken ad tebduḍ

source: Enter Demo
kab: Kcem deg usenɛet

# demoBadge
source: Demo
kab: Asenɛet

# createCollectionsPrompt
source: Create collections of related documents for easy reference
kab: Snulfu alqaḍ n yisemliyen i icudden ɣer yiwet n temselɣut fessusen

# fileUploadComingSoon
source: File upload for {type} is coming soon!
kab: Azdam n yifuyla i {type}, la d-teddun!

# skipServerSetupTryDemo
source: Skip server setup and try the demo
kab: Zgel tawila, tɛerḍeḍ asenɛet

# onboardStartBullet2
source: Use New Chat to reset context
kab: Seqdec adiwenni amaynut i uwennez n usatal

# onboardAttachTitle
source: Add context
kab: Rnu asatal

# onboardSpeakTitle
source: Speak naturally
kab: Serreḥ deg umeslay

# messageInputLabel
source: Message input
kab: Tira n yizen

# onlyHttpHttps
source: Only HTTP and HTTPS protocols are supported.
kab: Ala ineggafen HTTP d HTTPS i yettwasefraken.

# portRange
source: Port must be between 1 and 65535.
kab: Awwur yessefk ad yili gar 1 d 65535.

# invalidUrlFormat
source: Invalid URL format. Please check your input.
kab: Amasal URL d arameɣtu. Ssfqed tira-k⋅m, ma ulac aɣilif.

# serverNotOpenWebUI
source: This does not appear to be an Open-WebUI server.
kab: Wagi ur yettban ara d aqeddac Open-WebUI.

# serverAddressRequired
source: Server address is required (e.g., 192.168.1.10 or example.com).
kab: Tansa n uqeddac tesra (amedya, 192.168.1.10 neɣ amedya.com).

# invalidIpFormat
source: Invalid IP address format. Use format like 192.168.1.10.
kab: Amasal IP d arameɣtu. Amedya : 192.168.1.10.

# couldNotConnectGeneric
source: Couldn't connect. Double-check the address and try again.
kab: Ulac akk tuqqna. Senqed tansa syen ales i tikkelt niḍen.

# weCouldntReachServer
source: We couldn't reach the server. Check your connection and that the server is running.
kab: Negguma ad naweḍ ɣer uqeddac. Senqed tuqqna d waddad n uqeddac.

# connectionTimedOut
source: Connection timed out. The server might be busy or blocked by a firewall.
kab: Yekfa wakud n uraǧu. Aqeddac yezmer ad yili yecɣel neɣ yettusewḥel.

# invalidCredentials
source: Invalid username or password. Please try again.
kab: Isem n useqdac neɣ awal n uɛeddi d arameɣtu. Ales tikkelt niḍen.

# serverRedirectingHttps
source: The server is redirecting requests. Check your server's HTTPS configuration.
kab: Aqeddac yettwellih issutar. Senqed tawila HTTPS n uqeddac-ik⋅im.

# unableToConnectServer
source: Unable to connect to server. Please check your connection.
kab: D awezɣi tuqqna ɣer uqeddac. Ttxil-k×m senqed tuqqna-k⋅m.

# requestTimedOut
source: The request timed out. Please try again.
kab: Akud n uraǧu ifukk. Ɛreḍ tikkelt niḍen.

# genericSignInFailed
source: We couldn't sign you in. Check your credentials and server settings.
kab: Tuqqna d awezɣi. Senqed inekcam-ik×im d uqeddac.

# onboardStartSubtitle
source: Choose a model, then type below to begin. Tap New Chat anytime.
kab: Fren timudemt syen bdu tira. Sit ɣef udiwenni amaynut melmi i tebɣiḍ.

# onboardStartBullet1
source: Tap the model name in the top bar to switch models
kab: Sit ɣef yisem n timudemt ufella i usenfel-is

# onboardSpeakBullet2
source: Great for quick notes or long prompts
kab: Igerrez i tezmilin tuzribin neɣ i yiɣmisen n yineftaɣ

# onboardQuickSubtitle
source: Open the menu to switch between Chats, Workspace, and Profile.
kab: Ldi umuɣ i wakken ad tɛeddiḍ gar Yidiwenniyen, Adeg n umahil d Umaɣnu.

# onboardQuickBullet2
source: Start New Chat or manage models from the top bar
kab: Senker adiwenni amaynut neɣ sefrek timudmiwin seg ufeggag ufella

# onboardAttachSubtitle
source: Ground replies with content from Workspace or photos.
kab: Sban-d tiriryin s Wadeg n umahil neɣ s tewlafin.

# onboardSpeakSubtitle
source: Tap the mic to dictate with live waveform feedback.
kab: Sit ɣef usawaḍ i usiwel s tririt-tugna.

# featureRequiresInternet
source: This feature requires an internet connection
kab: Tamahilt-a tesra tuqqna ɣer internet

# offlineBanner
source: You're offline. Some features may be limited.
kab: Aql-k×kem d t⋅aruqqin⋅t. Kra n tmahilin yezmer ad sɛunt tilas.

# messagesWillSendWhenOnline
source: Messages will be sent when you're back online
kab: Iznan ad ttwaznen mi ara tuɣaleḍ ad teqqneḍ

# deleteChatMessage
source: This chat will be permanently deleted.
kab: Adiwenni-a ad yettwakkes i lebda.

# webSearchDescription
source: Search the web and cite sources in replies.
kab: Nadi deg Web syen bder-d iɣbula.

# onboardSpeakBullet1
source: Stop anytime; partial text is preserved
kab: ḥbes melmi i tebɣiḍ; aḍris abruyan yettwaḥrez

# onboardQuickBullet1
source: Tap the menu to access Chats, Workspace, Profile
kab: Sit ɣef wumuɣ i wakken ad tkecmeḍ ɣer Yidiwenniyen, Adeg n umahil, Amaɣnu
